# core
tap "homebrew/bundle"
brew "mas"
brew "ansible"
brew "stow"
brew "git"
brew "git-lfs"

# fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

# shell/terminal
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
cask "iterm2"

# utils
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "mkcert"
brew "nss"
brew "ripgrep"
brew "xh"
brew "zoxide"
brew "tldr"
brew "trash"

# dev
tap "oven-sh/bun"
brew "gh"
brew "glab"
brew "go"
brew "fnm"
brew "oven-sh/bun/bun"
cask "docker"

# UI apps
cask "authy"
cask "google-chrome"
cask "notion"
cask "slack"
cask "discord"
cask "zoom"
cask "steam"
mas "Telegram Lite", id: 946399090
mas "Habits", id: 1514915737
mas "Trello", id: 1278508951
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# NeoVim
brew "neovim"

# VS Code
cask "visual-studio-code"
vscode "a-h.templ"
vscode "arjun.swagger-viewer"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "jinliming2.vscode-go-template"
vscode "jock.svg"
vscode "johnpapa.vscode-cloak"
vscode "kamikillerto.vscode-colorize"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "otovo-oss.htmx-tags"
vscode "redhat.vscode-yaml"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"
vscode "vscodevim.vim"